api-senators/app/controllers/auth_controller.rb

def create
  user = User.find_by(email: user_login_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "gracie@gracie.com"], ["LIMIT", 1]]