api-senators/app/controllers/ratings_controller.rb

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."senator_id" = $1 LIMIT $2  [["senator_id", 1], ["LIMIT", 1]]
UPDATE "ratings" SET "user_rating" = $1, "updated_at" = $2 WHERE "ratings"."id" = $3  [["user_rating", "woke"], ["updated_at", "2020-02-27 20:13:46.143289"], ["id", 4]]
INSERT INTO "ratings" ("senator_id", "user_id", "user_rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["senator_id", 1], ["user_id", 1], ["user_rating", "joke"], ["created_at", "2020-02-26 15:17:59.662454"], ["updated_at", "2020-02-26 15:17:59.662454"]]
---
  def create
    rating = Rating.find_by(senator_id: params[:senator_id])
    u = {user_id: current_user.id}
    payload = rating_params.merge(u)
    if rating
      rating.update(payload)
      render json: { rating: rating }, status: :created
    else
      new_rating = Rating.create(payload)