api-senators/app/controllers/senators_controller.rb

  def index
    senators = Senator.all
---
SELECT "senators".* FROM "senators"