api-senators/app/controllers/users_controller.rb

SELECT "senators".* FROM "senators" INNER JOIN "ratings" ON "senators"."id" = "ratings"."senator_id" WHERE "ratings"."user_id" = $1  [["user_id", 6]]
---
  def user_senators
    user = User.find(current_user.id)
    # user_wokes = user.ratings.map{ |r| r.user_rating === 'woke' }
    # user_jokes = user.ratings.map{ |r| r.user_rating === 'joke' }
    senators = user.senators.map{|r| SenatorSerializer.new(r)}

INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.create(user_params)